/**
 * PlaylistPhrase
 * User: Alex
 * Date: 08.08.16
 * Time: 14:22
 */
package application.playlist {
	public class PlaylistPhrase {
		//--------------------------------------------------------------------------
		//  Constants
		//--------------------------------------------------------------------------
		static public const COPY_TO:String = 'Копіювати';
		static public const MOVE_TO:String = 'Перемістити';
		static public const OTHER_ARTISTS_SOUNDS:String = 'Інші записи виконавця';
		static public const OTHER_OWNER_SOUNDS:String = 'Інші записи власника';
		static public const OWNER_PAGE:String = 'Сторінка власника';
		static public const SHOW_TEXT:String = 'Показати текст';
		static public const SAVE:String = 'Зберегти';
		static public const DELETE:String = 'Видалити';

		static public const CLEAR:String = 'Очистити';
		static public const SORT_BY:String = 'Сортувати за';
		static public const ARTIST_NAME:String = 'виконавцями';
		static public const SOUND_NAME:String = 'записами';
		static public const GENRE:String = 'жанрами';
		static public const DURATION:String = 'тривалістю';
		static public const REFRESH:String = 'Оновити';

		//--------------------------------------------------------------------------
		//  Variables
		//--------------------------------------------------------------------------

		//--------------------------------------------------------------------------
		//  Public properties
		//--------------------------------------------------------------------------

		//--------------------------------------------------------------------------
		//  Protected properties
		//--------------------------------------------------------------------------

		//--------------------------------------------------------------------------
		//  Private properties
		//--------------------------------------------------------------------------

		//--------------------------------------------------------------------------
		//  Constructor
		//--------------------------------------------------------------------------	
		public function PlaylistPhrase() {

		}

		//--------------------------------------------------------------------------
		//  Public methods
		//--------------------------------------------------------------------------

		//--------------------------------------------------------------------------
		//  Protected methods
		//--------------------------------------------------------------------------

		//--------------------------------------------------------------------------
		//  Private methods
		//--------------------------------------------------------------------------

		//--------------------------------------------------------------------------
		//  Handlers
		//--------------------------------------------------------------------------

	}
}
